print("БАЗА PICTERS")
print(" ")
print("1. Одноклассники 7А")
print(" ")
select = input("Selected: ")
print(" ")

#Список Одноклассников

if select == "1":
    
    classmates = {
        "1": {"name": "Белорусцева Полина", "dob": "12.03.2011", "phone": "+79113167366"},
        "2": {"name": "Багаев Олег", "dob": "15.04.2010", "phone": "?"},
        "3": {"name": "Меликов Ислам", "dob": "08.07.2011", "phone": "+79640101740"},
        "4": {"name": "Панова Полина", "dob": "23.03.2011", "phone": "+79216611236"},
        "5": {"name": "Харламова Татьяна", "dob": "06.09.2011", "phone": "+79522918896"},
        "6": {"name": "Назарова Полина", "dob": "06.04.2011", "phone": "+79022822900"},
        "7": {"name": "Кузьменко Алексей", "dob": "22.06.2011", "phone": "9281858341"},
        "8": {"name": "Немкова Карина", "dob": "20.03.2008", "phone": "+79009355380"},
        "9": {"name": "Дорофеева Злата", "dob": "03.11.2011", "phone": "+79522959659"},
        "10": {"name": "Ткаченко Виктория", "dob": "12.03.2011", "phone": "+79113242050"},
        "11": {"name": "Николаев Роман", "dob": "06.04.2011", "phone": "+79533078859"},
        "12": {"name": "Олин Роман", "dob": "23.06.2011", "phone": "+79508903303"},
        "13": {"name": "Тихомиров Кирилл", "dob": "19.02.2011", "phone": "+79600282062"},
        "14": {"name": "Федотова Татьяна", "dob": "03.03.2011", "phone": "+79110647949"},
        "15": {"name": "Попритинский Андрей", "dob": "13.05.2011", "phone": "+79522982358"},
        "16": {"name": "Кудринский Тимофей", "dob": "16.02.2011", "phone": "+79095632901"},
        "17": {"name": "Фатальчук Никита", "dob": "17.04.2011", "phone": "+79190345461"},
        "18": {"name": "Федюкова Виктория", "dob": "07.08.2011", "phone": "+79600222830"},
        "19": {"name": "Макарова Милена", "dob": "01.08.2011", "phone": "+79113477069"},
        "20": {"name": "Матюнина Василиса", "dob": "12.10.2011", "phone": "+79118039066"},
        "21": {"name": "Попков Валерий", "dob": "27.01.2011", "phone": "+79113353905"},
        "22": {"name": "Петренко Валерия", "dob": "20.08.2011", "phone": "+79118016257"},
        "23": {"name": "Трофимчук Кристина", "dob": "13.10.2011", "phone": "+79113187047"},
        "24": {"name": "Сидоров Семён", "dob": "16.07.2011", "phone": "+79522690530"},
        "25": {"name": "Площадная Виктория", "dob": "18.08.2011", "phone": "+79095639604"},
        "26": {"name": "Лубянова Арина", "dob": "05.08.2011", "phone": "+79811631590"},
        
    }
    print("""
          1. Белорусцева Полина
          2. Багаев Олег
          3. Меликов Ислам
          4. Панова Полина
          5. Харламова Татьяна
          6. Назарова Полина
          7. Кузьменко Алексей
          8. Немкова Карина
          9. Дорофеева Злата
          10. Ткаченко Виктория
          11. Николаев Роман
          12. Олин Роман
          13. Тихомиров Кирилл
          14. Федотова Татьяна
          15. Попритинский Андрей
          16. Кудринский Тимофей
          17. Фатальчук Никита
          18. Федюкова Виктория
          19. Макарова Милена
          20. Матюнина Василиса
          21. Попков Валерий
          22. Петренко Валерия
          23. Трофимчук Кристина
          24. Сидоров Семён
          25. Площадная Виктория
          26. Лубянова Арина""")

del select

#Вывод данных
select = input("Selected: ")

if select in classmates:
        person = classmates[select]
        print(f"""
            ФИО: {person['name']}
            Дата Рождения: {person['dob']}
            Номер Телефона: {person['phone']}
        """)
else:
      print("Неверный выбор. Пожалуйста, выберите корректный пункт.")