print("БАЗА PICTERS")
print(" ")
print("1. Одноклассники 7А")
print(" ")
select = input("Selected: ")
print(" ")

# Список Одноклассников
if select == "1":
    print("""
          1. Белорусцева Полина
          2. Багаев Олег
          3. Меликов Ислам
          4. Панова Полина
          5. Харламова Татьяна
          6. Назарова Полина
          7. Кузьменко Алексей
          8. Немкова Карина
          9. Дорофеева Злата
          10. Ткаченко Виктория
          11. Николаев Роман
          12. Олин Роман
          13. Тихомиров Кирилл
          14. Федотова Татьяна
          15. Попритинский Андрей
          16. Кудринский Тимофей
          17. Фатальчук Никита
          18. Федюкова Виктория
          19. Макарова Милена
          20. Матюнина Василиса
          21. Попков Валерий
          22. Петренко Валерия
          23. Трофимчук Кристина
          24. Сидоров Семён
          25. Площадная Виктория
          26. Лубянова Арина""")
    del select

# Вывод данных
select = input("Selected: ")

# Белорусцева Полина
if select == "1":
    print("""
        ФИО: Полина Белорусцева
        Дата Рождения: 12.03.2011
        Номер Телефона: +79113167366
    """)
# Багаев Олег
elif select == "2":
    print("""
        ФИО: Багаев Олег
        Дата Рождения: 15.04.2010
        Номер Телефона: ?
    """)
# Меликов Ислам
elif select == "3":
    print("""
        ФИО: Меликов Ислам
        Дата Рождения: 08.07.2011
        Номер Телефона: +79640101740
    """)
# Панова Полина
elif select == "4":
    print("""
        ФИО: Панова Полина
        Дата Рождения: 23.03.2011
        Номер Телефона: +79216611236
    """)
# Харламова Татьяна
elif select == "5":
    print("""
        ФИО: Харламова Татьяна
        Дата Рождения: 06.09.2011
        Номер Телефона: +79522918896
    """)
# Назарова Полина
elif select == "6":
    print("""
        ФИО: Назарова Полина
        Дата Рождения: 06.04.2011
        Номер Телефона: +79022822900
    """)
# Кузьменко Алексей
elif select == "7":
    print("""
        ФИО: Кузьменко Алексей
        Дата Рождения: 22.06.2011
        Номер Телефона: +79281858341
    """)
# Немкова Карина
elif select == "8":
    print("""
        ФИО: Немкова Карина
        Дата Рождения: 20.03.2008
        Номер Телефона: +79009355380
    """)
# Дорофеева Злата
elif select == "9":
    print("""
        ФИО: Дорофеева Злата
        Дата Рождения: 03.11.2011
        Номер Телефона: +79522959659
    """)
# Ткаченко Виктория
elif select == "10":
    print("""
        ФИО: Ткаченко Виктория
        Дата Рождения: 12.03.2011
        Номер Телефона: +79113242050
    """)
# Николаев Роман
elif select == "11":
    print("""
        ФИО: Николаев Роман
        Дата Рождения: 06.04.2011
        Номер Телефона: +79533078859
    """)
# Олин Роман
elif select == "12":
    print("""
        ФИО: Олин Роман
        Дата Рождения: 23.06.2011
        Номер Телефона: +79508903303
    """)
# Тихомиров Кирилл
elif select == "13":
    print("""
        ФИО: Тихомиров Кирилл
        Дата Рождения: 19.02.2011
        Номер Телефона: +79600282062
    """)
# Федотова Татьяна
elif select == "14":
    print("""
        ФИО: Федотова Татьяна
        Дата Рождения: 03.03.2011
        Номер Телефона: +79110647949
    """)
# Попритинский Андрей
elif select == "15":
    print("""
        ФИО: Попритинский Андрей
        Дата Рождения: 13.05.2011
        Номер Телефона: +79522982358
    """)
# Кудринский Тимофей
elif select == "16":
    print("""
        ФИО: Кудринский Тимофей
        Дата Рождения: 16.02.2011
        Номер Телефона: +79095632901
    """)
# Фатальчук Никита
elif select == "17":
    print("""
        ФИО: Фатальчук Никита
        Дата Рождения: 17.04.2011
        Номер Телефона: +79190345461
    """)
# Федюкова Виктория
elif select == "18":
    print("""
        ФИО: Федюкова Виктория
        Дата Рождения: 07.08.2011
        Номер Телефона: +79600222830
    """)
# Макарова Милена
elif select == "19":
    print("""
        ФИО: Макарова Милена
        Дата Рождения: 01.08.2011
        Номер Телефона: +79113477069
    """)
# Матюнина Василиса
elif select == "20":
    print("""
        ФИО: Матюнина Василиса
        Дата Рождения: 12.10.2011
        Номер Телефона: +79118039066
    """)
# Попков Валерий
elif select == "21":
    print("""
        ФИО: Попков Валерий
        Дата Рождения: 27.01.2011
        Номер Телефона: +79113353905
    """)
# Петренко Валерия
elif select == "22":
    print("""
        ФИО: Петренко Валерия
        Дата Рождения: 20.08.2011
        Номер Телефона: +79118016257
    """)
# Трофимчук Кристина
elif select == "23":
    print("""
        ФИО: Трофимчук Кристина
        Дата Рождения: 13.10.2011
        Номер Телефона: +79113187047
    """)
# Сидоров Семён
elif select == "24":
    print("""
        ФИО: Сидоров Семён
        Дата Рождения: 16.07.2011
        Номер Телефона: +79522690530
    """)
# Площадная Виктория
elif select == "25":
    print("""
        ФИО: Площадная Виктория
        Дата Рождения: 18.08.2011
        Номер Телефона: +79095639604
    """)
# Лубянова Арина
elif select == "26":
    print("""
        ФИО: Лубянова Арина
        Дата Рождения: 05.08.2011
        Номер Телефона: +79811631590
    """)
else:
    print("Неверный выбор. Пожалуйста, выберите корректный пункт.")
